[Name.A_Anamelech_Name H7GlobalName]
mName="阿纳梅莱克"

[heropedya.A_HeroBio_Anamelech H7HeroBioData]
mText="知识就是力量。而阿纳梅莱克最想要的就是力量。因此阿纳梅莱克学习了他能学到的一切。当这一切完成后，他用他的盟友换取了知识。阿纳梅莱克成为了恶魔大师。"

[Archetype.A_Anamelech H7EditorHero]
mName=""
mLore=""

[Heros_names.A_Louis_Name H7GlobalName]
mName="路易"

[Necropolis_HallHeroes.A_HeroBio_Louis H7HeroBioData]
mText="两个多世纪前，当路易被咬时，他感到深深的沮丧。他怎么会如此无知？他决定游历每一座图书馆，阅读所有关于吸血鬼的书籍。五十年后，吸血鬼对他来说已再无秘密。他为此感到非常自豪，并决定花时间教导他的吸血鬼同胞。"

[Necropolis.A_Louis H7EditorHero]
mName=""
mLore=""

v1.37

[A_Jolan H7EditorHero]
mName=""
mLore=""

[Frost_HallHeroes.A_HeroBio_Jolan H7HeroBioData]
mText="约兰是托尔格和阿丽西亚的儿子。约兰也是奥戈塔伊的孙子，一位来自世界之外的强大法师，也是托尔格的父亲。约兰从小就展现出不寻常的能力，甚至到了能凭空想象出一个玩伴阿利诺埃的程度，直到这个玩伴变成了真实的存在。但当约兰试图接管远北地区的封地时，他运用他的技艺来治愈他的同胞，并以此确保牢固的联盟。毫无疑问，约兰注定要成就伟业。"

[Heros_names.A_Jolan_Name H7GlobalName]
mName="约兰"

v1.38.1

[A_Ranger_teacher H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="游侠导师"
mTooltip="为被放逐者和寒冰游侠增加 %buff1.buff.stat1 %icon_health 生命值，这些生物总是进行满额远程攻击。"

[A_Ranger_teacher_Buff H7BaseBuff]
mName="游侠导师"
mTooltip="增加 %stat1 %icon_health 生命值，这些生物总是进行满额远程攻击。"


[Heros_names.A_Thorgal_Name H7GlobalName]
mName="托尔格"

[A_Thorgal H7EditorHero]
mName=""
mLore=""

[Frost_HallHeroes.A_HeroBio_Thorgal H7HeroBioData]
mText="托尔格是约兰的父亲。托尔格是塔纳特洛克的孙子，一位来自另一个世界的强大法师。托尔格只有一个愿望：与他的妻子阿丽西亚以及他的两个孩子约兰和卢夫幸福地生活。但众神总是另有安排。托尔格在箭术方面发展出了非凡的才能。"


1.38.3

[Heros_names.A_Louve_Name H7GlobalName]
mName="卢夫"

[Haven.A_Louve H7EditorHero]
mName=""
mLore=""

[heropedya.A_HeroBio_Louve H7HeroBioData]
mText="卢夫是托尔格的女儿，也是约兰的妹妹。从她出生在狼窝起，她就保留并增强了与狼的特殊亲和力。"


[A_Gnoll_teacher H7HeroAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="豺狼人导师"
mTooltip="此英雄增加豺狼人和豺狼人猎手的生命值 %buff1.buff.stat1 %icon_health，这些生物总是进行满额远程攻击。"

[A_Gnoll_teacher_Buff H7BaseBuff]
mName="豺狼人导师"
mTooltip="增加 %stat1 %icon_health 生命值，这些生物总是进行满额远程攻击。"

[Name.A_Ammanas_Name H7GlobalName]
mName="阿马纳斯"

[Dungeon.A_Ammanas H7EditorHero]
mName=""
mLore=""

[heropedya.A_HeroBio_Ammanas H7HeroBioData]
mText="地下迷宫的主宰，他试图在他的刺客公会帮助下夺取权力。"

[Name.A_Jakan_Name H7GlobalName]
mName="贾坎"

[Inferno.A_Jakan H7EditorHero]
mName=""
mLore=""

[heropedya.A_HeroBio_Jakan H7HeroBioData]
mText="恶魔维度的领主，他希望通过他指挥的众多小恶魔部落来接管人类维度。"

[Name.A_Pran_Chole_Name H7GlobalName]
mName="普兰·乔勒"

[Stronghold.A_Pran_Chole H7EditorHero]
mName=""
mLore=""

[heropedya.A_HeroBio_Pran_Chole H7HeroBioData]
mText="克罗恩的塔兰·伊玛斯掷骨者，他是第33次贾古特战争的英雄。"

[Name.A_Pug_Name H7GlobalName]
mName="帕格"

[Academy.A_Pug H7EditorHero]
mName=""
mLore=""

[heropedya.A_HeroBio_Pug H7HeroBioData]
mText="人称巧手。帕格是克瑞德亚的孤儿，被法师库尔甘收养，并教他一些小法术。曾是帝国的囚犯，在那里学习了高等魔法。因其对克朗铎王国的贡献，成为星港公爵。"